In [37]:
import pandas as pd

In [38]:
"""
Programming Activity 1

Using the Titanic dataset and the Pandas library, fill in any missing data cells in the 'ages' column with the median age.
"""

dfT = pd.read_csv('/workspaces/DATA_3500_sandbox/titanic.csv')
median_age = dfT['Age'].median()
dfT['Age'].fillna(median_age, inplace=True)
dfT

/tmp/ipykernel_2210/2428505818.py:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dfT['Age'].fillna(median_age, inplace=True)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,28.0,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [39]:
"""
Programming Activity 2

Using the Titanic dataset and the Pandas library, create a new column called 'FamilySize' and fill it with the size of the passenger's family.
"""

dfT['FamilySize'] = dfT['SibSp'] + dfT['Parch'] + 1
dfT

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,28.0,1,2,W./C. 6607,23.4500,NaN,S,4
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1

In [40]:
"""
Programming Activity 3

Using the Titanic dataset and the Pandas library, find the average survival rate by class and sex.
"""

average_survival_rate = dfT.groupby(['Pclass', 'Sex'])['Survived'].mean().reset_index()
average_survival_rate

   Pclass     Sex  Survived
0       1  female  0.968085
1       1    male  0.368852
2       2  female  0.921053
3       2    male  0.157407
4       3  female  0.500000
5       3    male  0.135447

In [41]:
dfT.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
 12  FamilySize   891 non-null    int64
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

In [42]:
"""
Programming Activity 5

Using the Titanic dataset and the Pandas library, find the median age of survivors versus non-survivors.
"""
# dfT['median_age_survived'] = dfT.groupby(['Survived', 'Age']).median().reset_index()
dfT

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,28.0,1,2,W./C. 6607,23.4500,NaN,S,4
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1

In [43]:
"""
Programming Activity 6
Using the weather file (located on week 11 programming activities page), find the longest warm streak where the high temperature was above 65 degrees.

"""

dfW = pd.read_csv('/workspaces/DATA_3500_sandbox/SLC_weather.csv')
dfW['isWarm'] = dfW['Max Temp'] > 65
current_streak = 0
longest_streak = 0
for isWarm in dfW['isWarm']:
    if isWarm:
        current_streak += 1
        if current_streak > longest_streak:
            longest_streak = current_streak
    else:
        current_streak = 0

print(f"longest_streak: {longest_streak}")

longest_streak: 4

In [47]:
dfW.columns

Index(['Date', 'Max Temp', 'Min Temp', 'Avg Temp', 'Departure', 'HDD', 'CDD',
       'Precipitation', 'New Snow', 'Snow Depth', 'isWarm'],
      dtype='object')

In [49]:
"""
Programming Activity 7

Using the same weather dataset, find the hottest day and the coldest night.
"""
hottest_day = dfW.loc[dfW['Max Temp'].idxmax()]
coldest_night = dfW.loc[dfW['Min Temp'].idxmin()]

print(f"hottest_day: {hottest_day}")
print(f"coldest_night: {coldest_night}")

hottest_day: Date             10/3/2025
Max Temp                85
Min Temp                57
Avg Temp              71.0
Departure             10.6
HDD                      0
CDD                      6
Precipitation         0.14
New Snow                 0
Snow Depth               0
isWarm                True
Name: 2, dtype: object
coldest_night: Date             10/28/2025
Max Temp                 51
Min Temp                 30
Avg Temp               40.5
Departure              -8.9
HDD                      24
CDD                       0
Precipitation             0
New Snow                  0
Snow Depth                0
isWarm                False
Name: 27, dtype: object

In [45]:
"""
Programming Activity 8
Using the same weather dataset, find the single most volatile day (the day with the biggest difference between high and low temperature).

"""

volatility = dfW['Max Temp'] - dfW['Min Temp']
most_volatile_day = dfW.loc[volatility.idxmax()]
print(f"most_volatile_day: {most_volatile_day}")

most_volatile_day: Date             10/11/2025
Max Temp                 77
Min Temp                 42
Avg Temp               59.5
Departure               2.8
HDD                       5
CDD                       0
Precipitation           0.6
New Snow                  0
Snow Depth                M
isWarm                 True
Name: 10, dtype: object